; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared3 - mode
	infrared5 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	infrared2 - mode
	image6 - mode
	image4 - mode
	GroundStation4 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star2 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 infrared5)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument3 image6)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared3)
	(supports instrument4 image4)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument5 infrared2)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star2)
	(supports instrument6 image6)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared5)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
)
(:goal (and
	(pointing satellite3 GroundStation4)
	(have_image Star6 image4)
	(have_image Star6 image6)
	(have_image Phenomenon7 infrared5)
	(have_image Phenomenon7 image6)
	(have_image Planet8 spectrograph1)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 infrared5)
	(have_image Star10 infrared3)
	(have_image Phenomenon11 spectrograph1)
	(have_image Phenomenon12 infrared5)
	(have_image Phenomenon12 image4)
	(have_image Phenomenon13 image6)
	(have_image Phenomenon13 spectrograph1)
))

)

; plan
1. (turn_to satellite3 star2 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 star2)
   goals met: 0 of 14
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 14
3. (calibrate satellite3 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 0 of 14
4. (turn_to satellite3 star10 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star10)
   goals met: 0 of 14
5. (take_image satellite3 star10 instrument5 infrared3)
   added: (have_image star10 infrared3)
   goals met: 1 of 14
6. (turn_to satellite3 phenomenon9 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 phenomenon9)
   goals met: 1 of 14
7. (take_image satellite3 phenomenon9 instrument5 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 2 of 14
8. (turn_to satellite3 star2 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 star2)
   goals met: 2 of 14
9. (turn_to satellite2 groundstation0 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 groundstation0)
   goals met: 2 of 14
10. (turn_to satellite0 star1 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star1)
   goals met: 2 of 14
11. (switch_off instrument5 satellite3)
   deleted: (power_on instrument5)
   added: (power_avail satellite3)
   goals met: 2 of 14
12. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 2 of 14
13. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 14
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 14
15. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 2 of 14
16. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 2 of 14
17. (calibrate satellite3 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 2 of 14
18. (turn_to satellite0 phenomenon11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 14
19. (take_image satellite0 phenomenon11 instrument0 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 3 of 14
20. (turn_to satellite0 phenomenon13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 14
21. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 4 of 14
22. (turn_to satellite0 planet8 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet8)
   goals met: 4 of 14
23. (take_image satellite0 planet8 instrument0 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 5 of 14
24. (turn_to satellite2 phenomenon12 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon12)
   goals met: 5 of 14
25. (take_image satellite2 phenomenon12 instrument4 image4)
   added: (have_image phenomenon12 image4)
   goals met: 6 of 14
26. (turn_to satellite2 star6 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star6)
   goals met: 6 of 14
27. (take_image satellite2 star6 instrument4 image4)
   added: (have_image star6 image4)
   goals met: 7 of 14
28. (turn_to satellite3 phenomenon12 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon12)
   goals met: 7 of 14
29. (take_image satellite3 phenomenon12 instrument6 infrared5)
   added: (have_image phenomenon12 infrared5)
   goals met: 8 of 14
30. (turn_to satellite3 phenomenon13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon13)
   goals met: 8 of 14
31. (take_image satellite3 phenomenon13 instrument6 image6)
   added: (have_image phenomenon13 image6)
   goals met: 9 of 14
32. (turn_to satellite3 phenomenon7 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon7)
   goals met: 9 of 14
33. (take_image satellite3 phenomenon7 instrument6 image6)
   added: (have_image phenomenon7 image6)
   goals met: 10 of 14
34. (take_image satellite3 phenomenon7 instrument6 infrared5)
   added: (have_image phenomenon7 infrared5)
   goals met: 11 of 14
35. (turn_to satellite3 star10 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star10)
   goals met: 11 of 14
36. (take_image satellite3 star10 instrument6 infrared5)
   added: (have_image star10 infrared5)
   goals met: 12 of 14
37. (turn_to satellite3 star6 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star6)
   goals met: 12 of 14
38. (take_image satellite3 star6 instrument6 image6)
   added: (have_image star6 image6)
   goals met: 13 of 14
39. (turn_to satellite3 groundstation4 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 groundstation4)
   goals met: 14 of 14
